[

   "Fourteen days holed up here with peels of wallpaper, like streamers, looping in mock festivity above my head. Today is my birthday marking fourteen years, the past two weeks spent hiding in this carcass of wooden ribs, like Jonah, swallowed whole by a whale. The temperature dips, icing demolished cornstalks in the field, their season complete. My body’s a cash crop, harvested yearlong. Javier’s taunts echo like a dirge: Eres mio. Never leave. I will find you. Others visit here; they shoot-up, fuck, or sleep. We’ve struck a deal: leave me be, upstairs. When he finds me, I will jump."
 ,

   "Everything changed when we started to role play. I dressed up as sunrise, you the wanderer staring east over the ocean. I reached for you and suddenly was the shoreline, and you donned the leaves of a blue palmetto tree. You dug into the sand, where I was mica, you the glint of light off my belly. The encyclopedia claims you have perfect cleavage, you said, and I became text, you became fact, and our lives began to spiral around each other. Every now and then our shadows meet in passing, like an eclipse reminding the day of the stars."
 ,

   "The lime green coat with piping. She loves the way the coat shines, the contrast of greens, the acid of the lime against the pine-colored braids. Grit under her feet mixed with mud. The wind screaming, leaves scattering against her skin. A puddle. Clouds reflected, dizzy, the silvery light and her face, blurred. Not hard-edged and glass cold, a mirror to talk back like the boys on the street. Who’s got an ugly mug? Boyfriend didn’t like you, eh? She touches the scarred skin. Tree roots and lightning, brilliant. Reflected in the water there is only her own illuminated beauty."
 ,


 "Through the peeling wall I can hear you snap your bones one by one. Tiny pings of destruction. In the morning you start with your feet: small bones are easier. By noon, when the rain comes down in sheets, and the last of the leaves die off, you have moved to your fibula, working up to your femur. Not yet fifteen, you have an ageless resilience towards suffering, calling upon ancient curses that burn themselves on the backs of my eyelids, a list of all the mistakes I have made. The ways I didn’t protect you, and still am not."
,

  "She hasn’t been right since she hit the pheasant. It was a sign, she says. Of what, she doesn’t know, but it was definitely a sign. She worries about the lack of trees, about plastic in the oceans, about not waking up in the morning. She refuses to drive now. She closes her eyes and hums every time we pass a squashed rabbit or mangled fox. She grabs my knee, digs her claw nails deep into my flesh. It’s all just blood and guts and fur, she cries. Another pheasant, baking in the early evening sun. A badger, still twitching. "
,

  "The story goes that when bank robber Wells Duluth was shot dead, the bullet came out the other side encased in ice. The former fire & brimstone preacher had left his wife and children for a life of crime. It was spring in Cheyenne, Wyoming, but by nightfall the temperature fell from 55 degrees to 15 below. Beers turned to popsicles. Geese screamed from the river, legs locked in ice. A black cloud sagged to earth, crushing the church. They cremated Duluth in the iron welder’s stove, and by morning the cherry blossoms had bloomed, blowing through town like snow."
,

  "We called that bay “The Liver” then, for its brown thickness, for its shame. We had moved back in like roaches, once the wealthy foreigners abandoned us for someplace cleaner to enjoy themselves. I first found my way into the dirty water alone at five, while Mom swore, broke things, and licked her wounds like a wolf. I set out to sea on dirty styrofoam, drifted for years. I held my breath and grew tentacles. Finally grown, I emerged from the sea on a surfboard washed up in the muck, and went to discover what had happened to the wolf."
,

  "Our skin seeped into New York’s sod, roots drinking our veins. We tied ourselves over, and he licked my palms. His breath of onsen youth. I cupped myself underneath his collarbone and wrapped the Earth around us for our bed. The ﬂowers bloomed in our bedaubed hair, and when we used up all of our pence, we moved to the Bronx to unbend our heads. I bought a candle that whispered feeling into our lungs, ate his tears for supper, and asked him to stay. I howled away our bad dreams into the moon, his saltiness unraveling in my belly."
,


  "Wet footprints, dancing shadows along the edge of the pool. The turbid water glows like fireflies and in its dark center the moon, almost full, overhead.After the funeral, you cut swim trunks from your Sunday Suit, gave me the tie to wear as a belt.I’m not thinking about autumn Mondays or who will make me lunches now that we are only two, only how the moon will shatter when you collide with its reflection. Treading water, I wait for you to dive back in.When you jump, I go under. Together we touch bottom, buoy back up again"
,

  "“It’s a lonely washing that has no man’s shirt in it, Eileen, don’t you forget it.” That’s what my mother, quoting her mother, told me, and told me, and told me, as we moved from Tenafly to Teaneck to Trenton, and continued after I turned twelve and we went west, landing in four towns in eastern Pennsylvania, before finding a real home in Harrisburg. Harrisburg: high school, hickeys, and handsome Henry.But now I am thirty and settled, loving and loved, in Brooklyn, across the bridge from Jersey. We do our laundry, Lorena and I, and laugh about that line."
,

  "when the fish swallows the hook, the night falls, dragging purple down into the belly of the sea. to the little red cooler on the dock comes the blue gill — sore stomach heaving, spine twisted in his body, body molded furiously to the cup of my hand. I touch the scaling under his rolling eyes, press the pad of my thumb against his bulbous jelly lips, hold him — heaving chest and the sweaty slope of his jaw, the shuddering, guts spilling out white throat, hook snarled up into matted organ mass — and wind the line around my hand,and yank."
,

  "My girlfriend wipes her makeup off. We just fought. She wipes her face off, skin flapping. We’re still fighting. She takes bones from her skull, arranges them on the dresser. It’s how we fight. She removes the center’s guck, drips it across a hanger. (Birth’s a fight, a body argument.) Decapitated, non-corporeal, she sits.I crush myself into a golden-lotus foot binding, Houdini-style, crushing syndrome.Telekinesis, she turns out the light.I roll into a corner, away from the heater, so I don’t burn, melt.Mid-morning, we’re crisp and forgotten, my severed hand draped across her missing back—beautiful, American."
,

  "We picnicked by the sullen river, its water brown, opaque and dense enough for starving frogs to flop across. I offered you a slice of Sunbeam bread, the last unsoiled food we had. You chewed it out of spite, my routine generosity taken as offense. Whenever one of us moved the weatherworn table creaked and shifted. What good is money to us now? you sighed. Or fidelity? I pretended not to hear, staring at the splinters that hung like fingerlings along your pale, freckled arms. We had nothing worth keeping. Night began prematurely, as it does these days, with rain."
,


  "We watch each other in the blue glow of predawn, limbs entwined. We speak with our eyes: “I grow hair on my back now,” I say, “white keratin horns that I pluck when you’re not around. A white picket fence is really a series of spears meant to impale the raised chins of children like ours. Please don’t make me become what I am.” His eyes collect the shell of my body. My words fare the same. “At least your horns are white,” he says. “And in this light, your eyes are almost blue. Let’s dream a while, shall we?”"
,

  "Marissa and Carlos are in love. She told me. She told me she spends more nights at his place than at hers. “I started keeping a spare toothbrush there,” she said. She smiled a little smile that wasn’t meant for me. Swirled the melting ice in her glass at the restaurant table. We were outside, a gleam of sweat across our bodies. She brought the glass to her lips. Met my eyes.Later, I told Michael I’d be keeping a toothbrush at his place. From the other room: a huff. I turned on the faucet. Cold, like lips on ice"
,

  "when I am tossing the neon pink tennis ball the dog found under the porch, the man in the next yard hammers in staccato flurries and out in the state forest behind the house, a pileated woodpecker thrums an oak, little knowing the combined rhythms are just right for the other neighbor—the old lady in the black dress who carves goat heads out of pine—to close her eyes and begin the chant that tomorrow will guide aliens here, their ships a luminescent string of pop-it beads invisible in a sky busy with fireworks, populated with ghosts of stars."
,

  "All summer we stayed with Mazie’s mother, who smelled of lavender and gin. We strolled the boardwalk every day, pretend ladies in tattered lace, until Pierre bought us a sunflower, promised a three-course meal if we escorted him to a picture. That night the ocean thrashed and gulls swarmed the dunes. “Does Mommy keep a liquor cabinet?” Pierre asked. Mazie’s laugh was gilded, gorgeous. She put on a record and he danced until I dizzied. When I awoke, the room was empty. In the bedroom, Mazie stared sweet like a doll, flower petals underfoot, hands and skirt shimmering with pollen."
,

  "I snuck down there evenings he worked at the sawmill, to the lath and concrete room where he gutted perch, tossing tails to the cat. A galaxy of scales glistened on the tabletop, and specks of blood. But the floor was smooth, well-suited for skating to Journey’s “Don’t Stop Believin’.”I was the girl in the song, and the room—its rows of rods and reels, waders, nets and oars—transformed as I dreamt of getting out, no longer destined to pass every weekend on some Idaho lake, dropping fish into a bucket for my father to clean. Going nowhere."
,

  "I keep a photo of a stranger. I rescued him out of an estate sale cigar box. He looked the most like me. Yellowed, tattered, barebacked on the helm of the Claire de Lune. He’s always smiling at me, my dad. I keep the little grinning fisherman in my pocket. On long rides, I cradle him in my calloused hands. I tell him about that girl I left, the time I stole the Volvo, that fight with the guy at O’Malley’s. My smiling dad has no unkind word. I’m glad I chose this father; I almost chose one in a suit."
,

  "I walked into the wrong apartment coming back from work, and someone else’s wife embraced me.Later, I sat in bed reading one of her husband’s books while she enjoyed a cigarette. A young girl knocked on our bedroom door. She needed a ride to her flute lesson. The woman who was not my wife leaned over and asked, “Is she yours?”I answered. “I’ve never seen her before in my life”The girl began to sob; my not wife and I laughed and laughed."
,

  "We’re buzzing in our pews, the electricity of raw gossip flitting around us like so many wings. We feed on it, spread it around like a honey that sticks. Our madam archdeacon is at the center of it all, and if the rumors are true, no vestment can hide her guilt from the likes of us.The service is about to start. The organ hums to life, signalling the start of the processional: the venerable queen is about to emerge. Suspicion thickens the air like pollen. Our faces turn towards the narthex, primed to sting. Conditions are favorable for swarming."


]
